Micronet-Ltd/Net869_MT5/MQX_OS/BSP/platform/system/src/clock/MK20D10/fsl_clock_MK20D10.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <stdint.h>
#include <stdlib.h>
#include <stdbool.h>
#include <assert.h>
#include "fsl_device_registers.h"
#include "fsl_mcg_hal.h"
#include "fsl_sim_hal.h"
#include "fsl_clock_manager.h"

/*
 * README:
 * This file should provide these APIs:
 * 1. APIs to get the frequency of output clocks in Reference Manual ->
 * Chapter Clock Distribution -> Figure Clocking diagram.
 * 2. APIs for IP modules listed in Reference Manual -> Chapter Clock Distribution
 * -> Module clocks.
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#if FSL_FEATURE_SOC_ENET_COUNT
uint32_t g_enet1588ClkInFreq[ENET_EXT_CLK_COUNT];  /* ENET_1588_CLKIN  */
#endif
uint32_t g_sdhcClkInFreq[SDHC_EXT_CLK_COUNT];      /* SDHC_CLKIN       */
#if FSL_FEATURE_SOC_USB_COUNT
uint32_t g_usbClkInFreq[USB_EXT_CLK_COUNT];        /* USB_CLKIN        */
#endif
uint32_t g_ftmClkFreq[FTM_EXT_CLK_COUNT];          /* FTM_CLK0         */

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_SetSimConfigration
 * Description   : This funtion sets the SIM registers for clock transitiom.
 *
 *END**************************************************************************/
void CLOCK_SYS_SetSimConfigration(sim_config_t const *simConfig)
{
	CLOCK_HAL_SetOutDiv(SIM,
						simConfig->outdiv1,
						simConfig->outdiv2,
						simConfig->outdiv3,
						simConfig->outdiv4);

	CLOCK_HAL_SetPllfllSel(SIM, simConfig->pllFllSel);

	CLOCK_HAL_SetExternalRefClock32kSrc(SIM, simConfig->er32kSrc);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_SetConfiguration
 * Description   : This funtion sets the system to target configuration, it
 * only sets the clock modules registers for clock mode change, but not send
 * notifications to drivers.
 *
 *END**************************************************************************/
clock_manager_error_code_t CLOCK_SYS_SetConfiguration(clock_manager_user_config_t const* config)
{
	assert(NULL != config);

	/* Set outdiv for safe output clock frequency. */
	CLOCK_HAL_SetOutDiv(SIM, 0U, 1U, 1U, 4U);

	/* Set MCG mode. */
	CLOCK_SYS_SetMcgMode(&config->mcgConfig);

	/* Set SIM setting. */
	CLOCK_SYS_SetSimConfigration(&config->simConfig);

	/* Set OSCERCLK setting. */
	CLOCK_SYS_SetOscerConfigration(0, &config->oscerConfig);
	SystemCoreClock = CLOCK_SYS_GetCoreClockFreq();

	return kClockManagerSuccess;
}

clock_manager_error_code_t CLOCK_SYS_GetFreq(clock_names_t clockName,
												 uint32_t *frequency)
{
	clock_manager_error_code_t returnCode = kClockManagerSuccess;

	switch (clockName)
	{
		case kCoreClock:
		case kSystemClock:
			*frequency = CLOCK_SYS_GetCoreClockFreq();
			break;
		case kPlatformClock:
			*frequency = CLOCK_SYS_GetSystemClockFreq();
			break;
		case kBusClock:
			*frequency = CLOCK_SYS_GetBusClockFreq();
			break;
		case kFlexBusClock:
			*frequency = CLOCK_SYS_GetFlexbusFreq();
			break;
		case kFlashClock:
			*frequency = CLOCK_SYS_GetFlashClockFreq();
			break;
		case kOsc32kClock:
			*frequency = CLOCK_SYS_GetExternalRefClock32kFreq();
			break;
		case kOsc0ErClock:
			*frequency = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
			break;
		case kRtcoutClock:
			*frequency = CLOCK_SYS_GetRtcOutFreq();
			break;
		case kMcgFfClock:
			*frequency = CLOCK_SYS_GetFixedFreqClockFreq();
			break;
		case kMcgFllClock:
			*frequency = CLOCK_HAL_GetFllClk(MCG);
			break;
		case kMcgPll0Clock:
			*frequency = CLOCK_HAL_GetPll0Clk(MCG);
			break;
		case kMcgOutClock:
			*frequency = CLOCK_HAL_GetOutClk(MCG);
			break;
		case kMcgIrClock:
			*frequency = CLOCK_HAL_GetInternalRefClk(MCG);
			break;
		case kLpoClock:
			*frequency = CLOCK_SYS_GetLpoClockFreq();
			break;
		case kSystickClock:
			*frequency = CLOCK_SYS_GetSystickFreq();
			break;
		default:
			*frequency = 0U;
			returnCode = kClockManagerNoSuchClockName;
			break;
	}

	return returnCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetCoreClockFreq
 * Description   : Gets the core clock frequency.
 * This function gets the core clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetCoreClockFreq(void)
{
	return CLOCK_HAL_GetOutClk(MCG) / (CLOCK_HAL_GetOutDiv1(SIM) + 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetSystemClockFreq
 * Description   : Gets the system clock frequency.
 * This function gets the system clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetSystemClockFreq(void)
{
	return CLOCK_HAL_GetOutClk(MCG) / (CLOCK_HAL_GetOutDiv1(SIM) + 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetBusClockFreq
 * Description   : Gets the bus clock frequency.
 * This function gets the bus clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetBusClockFreq(void)
{
	return CLOCK_HAL_GetOutClk(MCG) / (CLOCK_HAL_GetOutDiv2(SIM) + 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetFlexbusFreq
 * Description   : Gets the clock frequency for FLEXBUS module
 * This function gets the clock frequency for FLEXBUS module.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetFlexbusFreq(void)
{
	return CLOCK_HAL_GetOutClk(MCG) / (CLOCK_HAL_GetOutDiv3(SIM) + 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetFlashClockFreq
 * Description   : Gets the flash clock frequency.
 * This function gets the flash clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetFlashClockFreq(void)
{
	return CLOCK_HAL_GetOutClk(MCG) / (CLOCK_HAL_GetOutDiv4(SIM) + 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetPllFllClockFreq
 * Description   : Gets the MCGPLLCLK/MCGFLLCLK/IRC48MCLK.
 * This function gets the frequency of the MCGPLLCLK/MCGFLLCLK/IRC48MCLK.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetPllFllClockFreq(void)
{
	uint32_t freq;
	clock_pllfll_sel_t src;

	src = CLOCK_HAL_GetPllfllSel(SIM);

	switch (src)
	{
		case kClockPllFllSelFll:
			freq = CLOCK_HAL_GetFllClk(MCG);
			break;
		case kClockPllFllSelPll:
			freq = CLOCK_HAL_GetPll0Clk(MCG);
			break;
		default:
			freq = 0U;
			break;
	}
	return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetRtcOutFreq
 * Description   : Gets the RTC_CLKOUT frequency.
 * This function gets RTC_CLKOUT  clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetRtcOutFreq(void)
{
	if (kClockRtcoutSrc1Hz == CLOCK_SYS_GetRtcOutSrc())
	{
		return g_xtalRtcClkFreq >> 15U;
	}
	else
	{
		return g_xtalRtcClkFreq;
	}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetExternalRefClockFreq
 * Description   : Gets the ERCLK32K clock frequency.
 * This function gets the external reference (ERCLK32K) clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetExternalRefClock32kFreq(void)
{
	clock_er32k_src_t src;
	uint32_t freq;

	src = CLOCK_HAL_GetExternalRefClock32kSrc(SIM);
	switch (src)
	{
		case kClockEr32kSrcOsc0:      /* OSC 32k clock  */
			freq = (32768U == g_xtal0ClkFreq) ? 32768U : 0U;
			break;
		case kClockEr32kSrcRtc:      /* RTC 32k clock  */
			freq = g_xtalRtcClkFreq;
			break;
		case kClockEr32kSrcLpo:         /* LPO clock      */
			freq = CLOCK_SYS_GetLpoClockFreq();
			break;
		default:
			freq = 0U;
			break;
	}

	return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetOsc0ExternalRefClockFreq
 * Description   : Gets OSC0ERCLK.
 * This function gets the OSC0 external reference frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetOsc0ExternalRefClockFreq(void)
{
	if (OSC_HAL_GetExternalRefClkCmd(g_oscBase[0]))
	{
		return g_xtal0ClkFreq;
	}
	else
	{
		return 0U;
	}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetWdogFreq
 * Description   : Gets watch dog clock frequency.
 * This function gets the watch dog clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetWdogFreq(uint32_t instance, clock_wdog_src_t wdogSrc)
{
	if (kClockWdogSrcLpoClk == wdogSrc)
	{
		return CLOCK_SYS_GetLpoClockFreq();
	}
	else
	{
		return CLOCK_SYS_GetBusClockFreq();
	}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetTraceFreq
 * Description   : Gets debug trace clock frequency.
 * This function gets the debug trace clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetTraceFreq(uint32_t instance)
{
	clock_trace_src_t src = CLOCK_HAL_GetTraceClkSrc(SIM);

	if (kClockTraceSrcMcgoutClk == src)
	{
		return CLOCK_HAL_GetOutClk(MCG) / 2U;
	}
	else
	{
		return CLOCK_SYS_GetCoreClockFreq() / 2U;
	}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetPortFilterFreq
 * Description   : Gets PORTx digital input filter clock frequency.
 * This function gets the PORTx digital input filter clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetPortFilterFreq(uint32_t instance, clock_port_filter_src_t src)
{
	if (kClockPortFilterSrcBusClk == src)
	{
		return CLOCK_SYS_GetBusClockFreq();
	}
	else
	{
		return CLOCK_SYS_GetLpoClockFreq();
	}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetLptmrFreq
 * Description   : Gets LPTMRx pre-scaler/glitch filter clock frequency.
 * This function gets the LPTMRx pre-scaler/glitch filter clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetLptmrFreq(uint32_t instance, clock_lptmr_src_t lptmrSrc)
{
	uint32_t freq;

