Micronet-Ltd/Net869_MT5/MQX_OS/BSP/platform/system/src/clock/MK20D10/fsl_clock_MK20D10.c
	switch (lptmrSrc)
	{
		case kClockLptmrSrcMcgIrClk:        /* MCG out clock  */
			freq = CLOCK_HAL_GetInternalRefClk(MCG);
			break;
		case kClockLptmrSrcLpoClk:             /* LPO clock     */
			freq = CLOCK_SYS_GetLpoClockFreq();
			break;
		case kClockLptmrSrcEr32kClk:        /* ERCLK32K clock */
			freq = CLOCK_SYS_GetExternalRefClock32kFreq();
			break;
		case kClockLptmrSrcOsc0erClk:        /* OSCERCLK clock */
			freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
			break;
		default:
			freq = 0U;
			break;
	}

	return freq;
}

#if FSL_FEATURE_SOC_ENET_COUNT
/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetEnetRmiiFreq
 * Description   : Gets the clock frequency for ENET module RMII clock.
 * This function gets the clock frequency for ENET module RMII clock.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetEnetRmiiFreq(uint32_t instance)
{
	/* get the sim clock source setting*/
	if (CLOCK_HAL_GetRmiiSrc(SIM, instance) == kClockRmiiSrcExtalClk)
	{
		return CLOCK_SYS_GetOsc0ExternalRefClockFreq();   /* OSCERCLK */
	}
	else
	{
		return g_enet1588ClkInFreq[0];      /* ENET_1588_CLKIN */
	}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetEnetTimeStampFreq
 * Description   : Gets the clock frequency for ENET module TIME clock.
 * This function gets the clock frequency for ENET module TIME clock.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetEnetTimeStampFreq(uint32_t instance)
{
	uint32_t freq;
	clock_time_src_t src;

	src = CLOCK_HAL_GetTimeSrc(SIM, instance);

	switch(src)
	{
		case kClockTimeSrcCoreSysClk: /* Core/System clock. */
			freq = CLOCK_SYS_GetCoreClockFreq();
			break;
		case kClockTimeSrcPllFllSel:  /* FLL/PLL/IRC48M. */
			freq = CLOCK_SYS_GetPllFllClockFreq();
			break;
		case kClockTimeSrcOsc0erClk:   /* OSCERCLK. */
			freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
			break;
		case kClockTimeSrcExt:        /* ENET 1588 clock in. */
			freq = g_enet1588ClkInFreq[0];
			break;
		default:
			freq = 0U;
			break;
	}
	return freq;
}
#endif

#if FSL_FEATURE_SOC_USB_COUNT
/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetUsbfFreq
 * Description   : Gets the clock frequency for USB FS OTG module.
 * This function gets the clock frequency for USB FS OTG module.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetUsbfsFreq(uint32_t instance)
{
	uint8_t usbdiv, usbfrac;
	uint32_t freq;
	clock_usbfs_src_t src;

	src = CLOCK_HAL_GetUsbfsSrc(SIM, instance);

	if (kClockUsbfsSrcExt == src)
	{
		return g_usbClkInFreq[0];       /* USB_CLKIN */
	}
	else
	{
		freq = CLOCK_SYS_GetPllFllClockFreq();

		CLOCK_HAL_GetUsbfsDiv(SIM, &usbdiv, &usbfrac);
		return freq * (usbfrac + 1) / (usbdiv + 1);
	}
}
#endif

#if FSL_FEATURE_SOC_FLEXCAN_COUNT
/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetFlexcanFreq
 * Description   : Gets FLEXCAN clock frequency.
 * This function gets the FLEXCAN clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetFlexcanFreq(uint32_t instance, clock_flexcan_src_t flexcanSrc)
{
	if (kClockFlexcanSrcOsc0erClk == flexcanSrc)
	{
		return CLOCK_SYS_GetOsc0ExternalRefClockFreq();
	}
	else
	{
		return CLOCK_SYS_GetBusClockFreq();
	}
}
#endif

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetUartFreq
 * Description   : Gets the clock frequency for UART module.
 * This function gets the clock frequency for UART module.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetUartFreq(uint32_t instance)
{
	uint32_t freq;

	switch (instance)
	{
		case 0:
		case 1:
			freq = CLOCK_SYS_GetSystemClockFreq();
			break;
		case 2:
		case 3:
		case 4:
		case 5:
			freq = CLOCK_SYS_GetBusClockFreq();
			break;
		default:
			freq = 0U;
			break;
	}

	return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetSdhcFreq
 * Description   : Gets the clock frequency for SDHC module
 * This function gets the clock frequency for SDHC module
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetSdhcFreq(uint32_t instance)
{
	uint32_t freq;
	clock_sdhc_src_t src;

	src = CLOCK_HAL_GetSdhcSrc(SIM, instance);

	switch (src)
	{
		case kClockSdhcSrcCoreSysClk:  /* Core/system clock */
			freq = CLOCK_SYS_GetCoreClockFreq();
			break;
		case kClockSdhcSrcPllFllSel:   /* Clock selected by SOPT2[PLLFLLSEL]. */
			freq = CLOCK_SYS_GetPllFllClockFreq();
			break;
		case kClockSdhcSrcOsc0erClk:    /* OSCERCLK clock */
			freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
			break;
		case kClockSdhcSrcExt:         /* External bypass clock (SDHC0_CLKIN) */
			freq = g_sdhcClkInFreq[0];
			break;
		default:
			freq = 0U;
			break;
	}

	return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetSaiFreq
 * Description   : Gets the clock frequency for SAI module
 * This function gets the clock frequency for SAI module.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetSaiFreq(uint32_t instance, clock_sai_src_t saiSrc)
{
	uint32_t freq;
	switch (saiSrc)
	{
		case kClockSaiSrcPllClk:
			freq = CLOCK_HAL_GetPll0Clk(MCG);
			break;
		case kClockSaiSrcOsc0erClk:
			freq = CLOCK_SYS_GetOsc0ExternalRefClockFreq();
			break;
		case kClockSaiSrcSysClk:
			freq = CLOCK_SYS_GetSystemClockFreq();
			break;
		default:
			freq = 0U;
			break;
	}

	return freq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetFtmExternalFreq
 * Description   : Gets FTM external clock frequency.
 *
 *END**************************************************************************/
uint32_t CLOCK_SYS_GetFtmExternalFreq(uint32_t instance)
{
	sim_ftm_clk_sel_t sel = SIM_HAL_GetFtmExternalClkPinMode(SIM, instance);

	if (kSimFtmClkSel0 == sel)
	{
		return g_ftmClkFreq[0];
	}
	else
	{
		return g_ftmClkFreq[1];
	}
}

/* PORT instance table. */
static const sim_clock_gate_name_t portGateTable[] =
{
	kSimClockGatePortA,
	kSimClockGatePortB,
	kSimClockGatePortC,
	kSimClockGatePortD,
	kSimClockGatePortE
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnablePortClock
 * Description   : Enable the clock for PORT module
 * This function enables the clock for PORT module
 *
 *END**************************************************************************/
void CLOCK_SYS_EnablePortClock(uint32_t instance)
{
	assert(instance < sizeof(portGateTable)/sizeof(portGateTable[0]));

	SIM_HAL_EnableClock(SIM, portGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisablePortClock
 * Description   : Disable the clock for PORT module
 * This function disables the clock for PORT module
 *
 *END**************************************************************************/
void CLOCK_SYS_DisablePortClock(uint32_t instance)
{
	assert(instance < sizeof(portGateTable)/sizeof(portGateTable[0]));

	SIM_HAL_DisableClock(SIM, portGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetPortGateCmd
 * Description   : Get the the clock gate state for PORT module
 * This function will get the clock gate state for PORT module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetPortGateCmd(uint32_t instance)
{
	assert(instance < sizeof(portGateTable)/sizeof(portGateTable[0]));

	return SIM_HAL_GetGateCmd(SIM, portGateTable[instance]);
}

