Micronet-Ltd/Net869_MT5/MQX_OS/BSP/platform/system/src/clock/MK20D10/fsl_clock_MK20D10.c
/* SPI instance table. */
static const sim_clock_gate_name_t spiGateTable[] =
{
	kSimClockGateSpi0,
	kSimClockGateSpi1,
	kSimClockGateSpi2
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableSpiClock
 * Description   : Enable the clock for SPI module
 * This function enables the clock for SPI module
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableSpiClock(uint32_t instance)
{
	assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

	SIM_HAL_EnableClock(SIM, spiGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableSpiClock
 * Description   : Disable the clock for SPI module
 * This function disables the clock for SPI module
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableSpiClock(uint32_t instance)
{
	assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

	SIM_HAL_DisableClock(SIM, spiGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetSpiGateCmd
 * Description   : Get the the clock gate state for SPI module
 * This function will get the clock gate state for SPI module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetSpiGateCmd(uint32_t instance)
{
	assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

	return SIM_HAL_GetGateCmd(SIM, spiGateTable[instance]);
}

/* I2C instance table. */
static const sim_clock_gate_name_t i2cGateTable[] =
{
	kSimClockGateI2c0,
	kSimClockGateI2c1
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableI2cClock
 * Description   : Enable the clock for I2C module
 * This function enables the clock for I2C module
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableI2cClock(uint32_t instance)
{
	assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

	SIM_HAL_EnableClock(SIM, i2cGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableI2cClock
 * Description   : Disable the clock for I2C module
 * This function disables the clock for I2C module
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableI2cClock(uint32_t instance)
{
	assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));
	SIM_HAL_DisableClock(SIM, i2cGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetI2cGateCmd
 * Description   : Get the the clock gate state for I2C module
 * This function will get the clock gate state for I2C module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetI2cGateCmd(uint32_t instance)
{
	assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

	return SIM_HAL_GetGateCmd(SIM, i2cGateTable[instance]);
}

/* Uart instance table. */
static const sim_clock_gate_name_t uartGateTable[] =
{
	kSimClockGateUart0,
	kSimClockGateUart1,
	kSimClockGateUart2,
	kSimClockGateUart3,
	kSimClockGateUart4,
	kSimClockGateUart5
};

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_EnableUartClock
 * Description   : Enable the clock for UART module
 * This function enables the clock for UART module
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableUartClock(uint32_t instance)
{
	assert(instance < sizeof(uartGateTable)/sizeof(uartGateTable[0]));

	SIM_HAL_EnableClock(SIM, uartGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_DisableUartClock
 * Description   : Disable the clock for UART module
 * This function enables the clock for UART module
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableUartClock(uint32_t instance)
{
	assert(instance < sizeof(uartGateTable)/sizeof(uartGateTable[0]));

	SIM_HAL_DisableClock(SIM, uartGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : SIM_HAL_GetUartGateCmd
 * Description   : Get the the clock gate state for UART module
 * This function will get the clock gate state for UART module.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetUartGateCmd(uint32_t instance)
{
	assert(instance < sizeof(uartGateTable)/sizeof(uartGateTable[0]));

	return SIM_HAL_GetGateCmd(SIM, uartGateTable[instance]);
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
